Autodesk.Revit.DB.ScheduleFieldDisplayType
Display type of schedule field.
Since:
2017
Since:
2017

Autodesk.Revit.DB.ScheduleFieldDisplayType.Min
Calculates and displays the minimum value

Autodesk.Revit.DB.ScheduleFieldDisplayType.Max
Calculates and displays the maximum value

Autodesk.Revit.DB.ScheduleFieldDisplayType.MinMax
Calculates and displays the minimum and maximum values

Autodesk.Revit.DB.ScheduleFieldDisplayType.Totals
Calculates and displays the total value

Autodesk.Revit.DB.ScheduleFieldDisplayType.Standard
Standard: nothing is displayed if the values of the elements are different, otherwise, the common value will be displayed